app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-09-29 03:59:47.509780"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student = Student.update(student_params(:first_name, :last_name))